AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/third_party/cordio/wsf/include/hci_defs.h
/*************************************************************************************************/
/*!
 *  \file   hci_defs.h
 *
 *  \brief  HCI constants and definitions from the Bluetooth specification.
 *
 *  Copyright (c) 2009-2019 ARM Ltd. All Rights Reserved.
 *
 *  Copyright (c) 2019-2020 Packetcraft, Inc.
 *
 *  Licensed under the Apache License, Version 2.0 (the "License");
 *  you may not use this file except in compliance with the License.
 *  You may obtain a copy of the License at
 *
 *      http://www.apache.org/licenses/LICENSE-2.0
 *
 *  Unless required by applicable law or agreed to in writing, software
 *  distributed under the License is distributed on an "AS IS" BASIS,
 *  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *  See the License for the specific language governing permissions and
 *  limitations under the License.
 */

/*************************************************************************************************/
/*!
 *  \brief HCI constants and definitions from the Bluetooth specification.
 */
/*************************************************************************************************/
#ifndef HCI_DEFS_H
#define HCI_DEFS_H

#ifdef __cplusplus
extern "C" {
#endif

/*! \addtogroup STACK_HCI_API
 *  \{ */

/** \name Packet definitions
 *
 */
/**@{*/
#define HCI_CMD_HDR_LEN                              3       /*!< \brief Command packet header length */
#define HCI_ACL_HDR_LEN                              4       /*!< \brief ACL packet header length */
#define HCI_ISO_HDR_LEN                              4       /*!< \brief ISO packet header length */
#define HCI_EVT_HDR_LEN                              2       /*!< \brief Event packet header length */
#define HCI_EVT_PARAM_MAX_LEN                        255     /*!< \brief Maximum length of event packet parameters */
#define HCI_ACL_DEFAULT_LEN                          27      /*!< \brief Default maximum ACL packet length */
#define HCI_PB_FLAG_MASK                             0x3000  /*!< \brief ACL packet boundary flag mask */
#define HCI_PB_START_H2C                             0x0000  /*!< \brief Packet boundary flag, start, host-to-controller */
#define HCI_PB_CONTINUE                              0x1000  /*!< \brief Packet boundary flag, continue */
#define HCI_PB_START_C2H                             0x2000  /*!< \brief Packet boundary flag, start, controller-to-host */
#define HCI_HANDLE_MASK                              0x0FFF  /*!< \brief Mask for handle bits in ACL packet */
#define HCI_HANDLE_NONE                              0xFFFF  /*!< \brief Value for invalid handle */

/* User can define the maximum parameter lengths of vendor specific events base on the application requirement */
#define HCI_EVT_VENDOR_SPEC_CMD_CMPL_PARAM_MAX_LEN   130     /*!< \brief Maximum length of vendor specific command complete event parameter */
#define HCI_EVT_VENDOR_SPEC_EVT_PARAM_MAX_LEN        1       /*!< \brief Maximum length of vendor specific event parameter */

#define HCI_ISO_DL_MIN_LEN                           4       /*!< ISO Data Load header minimum length */
#define HCI_ISO_DL_MAX_LEN                           8       /*!< ISO Data Load header maximum length */
#define HCI_ISO_TS_LEN                               4       /*!< ISO Data Load timestamp length */

/**@}*/

/** \name Packet types
 *
 */
#define HCI_CMD_TYPE                                 1       /*!< \brief HCI command packet */
#define HCI_ACL_TYPE                                 2       /*!< \brief HCI ACL data packet */
#define HCI_EVT_TYPE                                 4       /*!< \brief HCI event packet */
#define HCI_ISO_TYPE                                 5       /*!< \brief HCI ISO data packet */
/**@}*/

/** \name Error codes
 *
 */
/**@{*/
#define HCI_SUCCESS                                  0x00    /*!< \brief Success */
#define HCI_ERR_UNKNOWN_CMD                          0x01    /*!< \brief Unknown HCI command */
#define HCI_ERR_UNKNOWN_HANDLE                       0x02    /*!< \brief Unknown connection identifier */
#define HCI_ERR_HARDWARE_FAILURE                     0x03    /*!< \brief Hardware failure */
#define HCI_ERR_PAGE_TIMEOUT                         0x04    /*!< \brief Page timeout */
#define HCI_ERR_AUTH_FAILURE                         0x05    /*!< \brief Authentication failure */
#define HCI_ERR_KEY_MISSING                          0x06    /*!< \brief PIN or key missing */
#define HCI_ERR_MEMORY_EXCEEDED                      0x07    /*!< \brief Memory capacity exceeded */
#define HCI_ERR_CONN_TIMEOUT                         0x08    /*!< \brief Connection timeout */
#define HCI_ERR_CONN_LIMIT                           0x09    /*!< \brief Connection limit exceeded */
#define HCI_ERR_SYNCH_CONN_LIMIT                     0x0A    /*!< \brief Synchronous connection limit exceeded */
#define HCI_ERR_ACL_CONN_EXISTS                      0x0B    /*!< \brief ACL connection already exists */
#define HCI_ERR_CMD_DISALLOWED                       0x0C    /*!< \brief Command disallowed */
#define HCI_ERR_REJ_RESOURCES                        0x0D    /*!< \brief Connection rejected limited resources */
#define HCI_ERR_REJ_SECURITY                         0x0E    /*!< \brief Connection rejected security reasons */
#define HCI_ERR_REJ_BD_ADDR                          0x0F    /*!< \brief Connection rejected unacceptable BD_ADDR */
#define HCI_ERR_ACCEPT_TIMEOUT                       0x10    /*!< \brief Connection accept timeout exceeded */
#define HCI_ERR_UNSUP_FEAT                           0x11    /*!< \brief Unsupported feature or parameter value */
#define HCI_ERR_INVALID_PARAM                        0x12    /*!< \brief Invalid HCI command parameters */
#define HCI_ERR_REMOTE_TERMINATED                    0x13    /*!< \brief Remote user terminated connection */
#define HCI_ERR_REMOTE_RESOURCES                     0x14    /*!< \brief Remote device low resources */
#define HCI_ERR_REMOTE_POWER_OFF                     0x15    /*!< \brief Remote device power off */
#define HCI_ERR_LOCAL_TERMINATED                     0x16    /*!< \brief Connection terminated by local host */
#define HCI_ERR_REPEATED_ATTEMPTS                    0x17    /*!< \brief Repeated attempts */
#define HCI_ERR_PAIRING_NOT_ALLOWED                  0x18    /*!< \brief Pairing not allowed */
#define HCI_ERR_UNKNOWN_LMP_PDU                      0x19    /*!< \brief Unknown LMP PDU */
#define HCI_ERR_UNSUP_REMOTE_FEAT                    0x1A    /*!< \brief Unsupported remote feature */
#define HCI_ERR_SCO_OFFSET                           0x1B    /*!< \brief SCO offset rejected */
#define HCI_ERR_SCO_INTERVAL                         0x1C    /*!< \brief SCO interval rejected */
#define HCI_ERR_SCO_MODE                             0x1D    /*!< \brief SCO air mode rejected */
#define HCI_ERR_LMP_PARAM                            0x1E    /*!< \brief Invalid LMP parameters */
#define HCI_ERR_UNSPECIFIED                          0x1F    /*!< \brief Unspecified error */
#define HCI_ERR_UNSUP_LMP_PARAM                      0x20    /*!< \brief Unsupported LMP parameter value */
#define HCI_ERR_ROLE_CHANGE                          0x21    /*!< \brief Role change not allowed */
#define HCI_ERR_LL_RESP_TIMEOUT                      0x22    /*!< \brief LL response timeout */
#define HCI_ERR_LMP_COLLISION                        0x23    /*!< \brief LMP error transaction collision */
#define HCI_ERR_LMP_PDU                              0x24    /*!< \brief LMP pdu not allowed */
#define HCI_ERR_ENCRYPT_MODE                         0x25    /*!< \brief Encryption mode not acceptable */
#define HCI_ERR_LINK_KEY                             0x26    /*!< \brief Link key can not be changed */
#define HCI_ERR_UNSUP_QOS                            0x27    /*!< \brief Requested qos not supported */
#define HCI_ERR_INSTANT_PASSED                       0x28    /*!< \brief Instant passed */
#define HCI_ERR_UNSUP_UNIT_KEY                       0x29    /*!< \brief Pairing with unit key not supported */
#define HCI_ERR_TRANSACT_COLLISION                   0x2A    /*!< \brief Different transaction collision */
#define HCI_ERR_CHANNEL_CLASS                        0x2E    /*!< \brief Channel classification not supported */
#define HCI_ERR_MEMORY                               0x2F    /*!< \brief Insufficient security */
#define HCI_ERR_PARAMETER_RANGE                      0x30    /*!< \brief Parameter out of mandatory range */
#define HCI_ERR_ROLE_SWITCH_PEND                     0x32    /*!< \brief Role switch pending */
#define HCI_ERR_RESERVED_SLOT                        0x34    /*!< \brief Reserved slot violation */
#define HCI_ERR_ROLE_SWITCH                          0x35    /*!< \brief Role switch failed */
#define HCI_ERR_INQ_TOO_LARGE                        0x36    /*!< \brief Extended inquiry response too large */
#define HCI_ERR_UNSUP_SSP                            0x37    /*!< \brief Secure simple pairing not supported by host */
#define HCI_ERR_HOST_BUSY_PAIRING                    0x38    /*!< \brief Host busy - pairing */
#define HCI_ERR_NO_CHANNEL                           0x39    /*!< \brief Connection rejected no suitable channel */
#define HCI_ERR_CONTROLLER_BUSY                      0x3A    /*!< \brief Controller busy */
#define HCI_ERR_CONN_INTERVAL                        0x3B    /*!< \brief Unacceptable connection interval */
#define HCI_ERR_ADV_TIMEOUT                          0x3C    /*!< \brief Advertising timeout */
#define HCI_ERR_MIC_FAILURE                          0x3D    /*!< \brief Connection terminated due to MIC failure */
#define HCI_ERR_CONN_FAIL                            0x3E    /*!< \brief Connection failed to be established */
#define HCI_ERR_MAC_CONN_FAIL                        0x3F    /*!< \brief MAC connection failed */
#define HCI_ERR_COARSE_CLK_ADJ_REJ                   0x40    /*!< \brief Coarse clock adjustment rejected */
#define HCI_ERR_TYPE0_SUBMAP_NOT_DEF                 0x41    /*!< \brief Type0 submap not defined */
#define HCI_ERR_UNKNOWN_ADV_ID                       0x42    /*!< \brief Unknown advertising identifier */
#define HCI_ERR_LIMIT_REACHED                        0x43    /*!< \brief Limit reached */
#define HCI_ERR_OP_CANCELLED_BY_HOST                 0x44    /*!< \brief Operation cancelled by host */
/*! \brief New in version 5.1 */
#define HCI_ERR_PKT_TOO_LONG                         0x45    /*!< \brief Packet too long */
/**@}*/

/** \name Command groups
 *
 */
/**@{*/
#define HCI_OGF_NOP                                  0x00    /*!< \brief No operation */
#define HCI_OGF_LINK_CONTROL                         0x01    /*!< \brief Link control */
#define HCI_OGF_LINK_POLICY                          0x02    /*!< \brief Link policy */
#define HCI_OGF_CONTROLLER                           0x03    /*!< \brief Controller and baseband */
#define HCI_OGF_INFORMATIONAL                        0x04    /*!< \brief Informational parameters */
#define HCI_OGF_STATUS                               0x05    /*!< \brief Status parameters */
#define HCI_OGF_TESTING                              0x06    /*!< \brief Testing */
#define HCI_OGF_LE_CONTROLLER                        0x08    /*!< \brief LE controller */
#define HCI_OGF_VENDOR_SPEC                          0x3F    /*!< \brief Vendor specific */
/**@}*/

/** \name NOP command
 *
 */
/**@{*/
#define HCI_OCF_NOP                                  0x00
/**@}*/

/** \name Link control commands
 *
 */
/**@{*/
#define HCI_OCF_DISCONNECT                           0x06
#define HCI_OCF_READ_REMOTE_VER_INFO                 0x1D
/**@}*/

/*! \brief Link policy commands (none used for LE) */

