AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/third_party/cordio/wsf/include/hci_defs.h
/** \name Advertising report data status
 *
 */
/**@{*/
#define HCI_ADV_RPT_DATA_CMPL                        0x00    /*!< \brief Data complete */
#define HCI_ADV_RPT_DATA_INCMPL_MORE                 0x01    /*!< \brief Data incomplete, more date to come */
#define HCI_ADV_RPT_DATA_INCMPL_TRUNC                0x02    /*!< \brief Data incomplete, data truncated, no more date to come */
/**@}*/

/** \name Extended advertising report event primary PHY values
 *
 */
/**@{*/
#define HCI_ADV_RPT_PHY_PRIM_LE_1M                   0x01    /*!< \brief Advertiser PHY is LE 1M */
#define HCI_ADV_RPT_PHY_PRIM_LE_CODED                0x03    /*!< \brief Advertiser PHY is LE Coded */
/**@}*/

/** \name Extended advertising report event seconday PHY values
 *
 */
/**@{*/
#define HCI_ADV_RPT_PHY_SEC_NONE                     0x00    /*!< \brief No packets on seconday advertising channel */
#define HCI_ADV_RPT_PHY_SEC_LE_1M                    0x01    /*!< \brief Advertiser PHY is LE 1M */
#define HCI_ADV_RPT_PHY_SEC_LE_2M                    0x02    /*!< \brief Advertiser PHY is LE 2M */
#define HCI_ADV_RPT_PHY_SEC_LE_CODED                 0x03    /*!< \brief Advertiser PHY is LE Coded */
/**@}*/

/** \name Channel selection algorithm used
 *
 */
/**@{*/
#define HCI_CH_SEL_ALGO_1                            0x00   /*!< \brief LE channel selection algorithm #1 used */
#define HCI_CH_SEL_ALGO_2                            0x01   /*!< \brief LE channel selection algorithm #2 used */
/**@}*/

/** \name KeyType parameters
 *
 */
/**@{*/
#define HCI_PRIVATE_KEY_GENERATED                    0x00    /*!< \brief Use generated private key */
#define HCI_PRIVATE_KEY_DEBUG                        0x01    /*!< \brief Use debug private key */
/**@{*/

/**@{*/
/** \name Minimum number of used channels
 *
 */
/**@{*/
#define HCI_MIN_NUM_OF_USED_CHAN                     8      /*!< \brief Minimum number of used channels */
/**@}*/

/** \name Synchronization timeout for the periodic advertising
*
*/
/**@{*/
#define HCI_SYNC_MIN_TIMEOUT                         0x000A  /*!< \brief Minimum synchronization timeout */
#define HCI_SYNC_MAX_TIMEOUT                         0x4000  /*!< \brief Maximum synchronization timeout */
/**@}*/

/** \name Maximum synchronization skip
*
*/
/**@{*/
#define HCI_SYNC_MAX_SKIP                            0x01F3  /*!< \brief Maximum synchronization skip */
/**@}*/

/** \name Maximum synchronization handle
*
*/
/**@{*/
#define HCI_SYNC_MAX_HANDLE                          0x0EFF  /*!< \brief Maximum synchronization handle */
/**@}*/

/** \name Periodic sync transfer receive mode
*
*/
/**@{*/
#define HCI_SYNC_TRSF_MODE_OFF                       0x00   /*!< \brief Periodic sync transfer receive is disabled */
#define HCI_SYNC_TRSF_MODE_REP_DISABLED              0x01,  /*!< \brief Periodic sync transfer receive is enabled, report event is disabled */
#define HCI_SYNC_TRSF_MODE_REP_ENABLED               0x02,  /*!< \brief Periodic sync transfer receive is enabled, report event is enabled */
/**@}*/

/** \name Periodic advertising create sync options bits
*
*/
/**@{*/
#define HCI_OPTIONS_FILT_POLICY_BIT                  (1<<0)  /*!< \brief filter policy bit */
#define HCI_OPTIONS_INIT_RPT_ENABLE_BIT              (1<<1)  /*!< \brief initial periodic advertisement reporting bit */
/**@}*/

/** \name Misc command parameters
 *
 */
/**@{*/
#define HCI_READ_TX_PWR_CURRENT                      0       /*!< \brief Read current tx power */
#define HCI_READ_TX_PWR_MAX                          1       /*!< \brief Read maximum tx power */
#define HCI_TX_PWR_MIN                               -30     /*!< \brief Minimum tx power dBm */
#define HCI_TX_PWR_MAX                               20      /*!< \brief Maximum tx power dBm */
#define HCI_TX_PWR_NO_PREFERENCE                     127     /*!< \brief Tx power no preference */
#define HCI_VERSION                                  6       /*!< \brief HCI specification version */
#define HCI_RSSI_MIN                                 -127    /*!< \brief Minimum RSSI dBm */
#define HCI_RSSI_MAX                                 20      /*!< \brief Maximum RSSI dBm */
#define HCI_ADDR_TYPE_PUBLIC                         0       /*!< \brief Public device address */
#define HCI_ADDR_TYPE_RANDOM                         1       /*!< \brief Random device address */
#define HCI_ADDR_TYPE_PUBLIC_IDENTITY                2       /*!< \brief Public identity address */
#define HCI_ADDR_TYPE_RANDOM_IDENTITY                3       /*!< \brief Random identity address */
#define HCI_ADDR_TYPE_ANONYMOUS                      0xFF    /*!< \brief Anonymous device address */
#define HCI_FILT_NONE                                0       /*!< \brief Accept all advertising packets */
#define HCI_FILT_WHITE_LIST                          1       /*!< \brief Accept from While List only */
#define HCI_FILT_RES_INIT                            2       /*!< \brief Accept directed advertisements with RPAs */
#define HCI_FILT_WHITE_LIST_RES_INIT                 3       /*!< \brief Accept from White List or directed advertisements with RPAs */
#define HCI_FILT_PER_ADV_PARAM                       0       /*!< \brief Listen to advertiser specified by create sync command parameters */
#define HCI_FILT_PER_ADV_LIST                        1       /*!< \brief Listen to advertiser from Periodic Advertiser List only */
#define HCI_ROLE_MASTER                              0       /*!< \brief Role is master */
#define HCI_ROLE_SLAVE                               1       /*!< \brief Role is slave */
#define HCI_PRIV_MODE_NETWORK                        0x00    /*!< \brief Network privacy mode (default) */
#define HCI_PRIV_MODE_DEVICE                         0x01    /*!< \brief Device privacy mode */
/**@}*/

/** \name PHY types
 *
 */
/**@{*/
#define HCI_PHY_NONE                                 0x00    /*!< \brief No selected PHY */
#define HCI_PHY_LE_1M_BIT                            (1<<0)  /*!< \brief LE 1M PHY */
#define HCI_PHY_LE_2M_BIT                            (1<<1)  /*!< \brief LE 2M PHY */
#define HCI_PHY_LE_CODED_BIT                         (1<<2)  /*!< \brief LE Coded PHY */
/**@}*/

