AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/third_party/cordio/wsf/include/hci_defs.h
/** \name All PHYs preference
 *
 */
/**@{*/
#define HCI_ALL_PHY_ALL_PREFERENCES                  0x00    /*!< \brief All PHY preferences */
#define HCI_ALL_PHY_TX_PREFERENCE_BIT                (1<<0)  /*!< \brief Tx PHY preference */
#define HCI_ALL_PHY_RX_PREFERENCE_BIT                (1<<1)  /*!< \brief Rx PHY preference */
/**@}*/

/** \name PHY options
 *
 */
/**@{*/
#define HCI_PHY_OPTIONS_NONE                         0x00    /*!< \brief No preferences */
#define HCI_PHY_OPTIONS_S2_PREFERRED                 0x01    /*!< \brief S=2 coding preferred when transmitting on LE Coded PHY */
#define HCI_PHY_OPTIONS_S8_PREFERRED                 0x02    /*!< \brief S=8 coding preferred when transmitting on LE Coded PHY */
/**@}*/

/** \name CTE Slot Durations
*
*/
/**@{*/
#define HCI_CTE_SLOT_DURATION_NONE                   0x00    /*!< \brief No switching and sampling */
#define HCI_CTE_SLOT_DURATION_1_US                   0x01    /*!< \brief Switching and sampling slots are 1 us each */
#define HCI_CTE_SLOT_DURATION_2_US                   0x02    /*!< \brief Switching and sampling slots are 2 us each */
/**@}*/

/** \name Permitted CTE Type bits
*
*/
/**@{*/
#define HCI_CTE_TYPE_PERMIT_AOA_RSP_BIT              (1<<0)  /*!< \brief Allow AoA Constant Tone Extension Response */
#define HCI_CTE_TYPE_PERMIT_AOD_RSP_1_US_BIT         (1<<1)  /*!< \brief Allow AoD Constant Tone Extension Response with 1 us slots */
#define HCI_CTE_TYPE_PERMIT_AOD_RSP_2_US_BIT         (1<<2)  /*!< \brief Allow AoD Constant Tone Extension Response with 2 us slots */
/**@}*/

/** \name Requested CTE Types
*
*/
/**@{*/
#define HCI_CTE_TYPE_REQ_AOA                         0x00    /*!< \brief AoA Constant Tone Extension */
#define HCI_CTE_TYPE_REQ_AOD_1_US                    0x01    /*!< \brief AoD Constant Tone Extension with 1 us slots */
#define HCI_CTE_TYPE_REQ_AOD_2_US                    0x02    /*!< \brief AoD Constant Tone Extension with 2 us slots */
/**@}*/

/** \name Bluetooth core specification versions
 *
 */
/**@{*/
#define HCI_VER_BT_CORE_SPEC_4_0                     0x06    /*!< Bluetooth core specification 4.0 */
#define HCI_VER_BT_CORE_SPEC_4_1                     0x07    /*!< Bluetooth core specification 4.1 */
#define HCI_VER_BT_CORE_SPEC_4_2                     0x08    /*!< Bluetooth core specification 4.2 */
#define HCI_VER_BT_CORE_SPEC_5_0                     0x09    /*!< Bluetooth core specification 5.0 */
#define HCI_VER_BT_CORE_SPEC_5_1                     0x0A    /*!< Bluetooth core specification 5.1 */
#define HCI_VER_BT_CORE_SPEC_5_2                     0x0B    /*!< Bluetooth core specification 5.2 */
/**@}*/

/** \name Parameter lengths
 *
 */
/**@{*/
#define HCI_EVT_MASK_LEN                             8       /*!< Length of event mask byte array */
#define HCI_EVT_MASK_PAGE_2_LEN                      8       /*!< Length of event mask page 2 byte array */
#define HCI_LE_EVT_MASK_LEN                          8       /*!< Length of LE event mask byte array */
#define HCI_FEAT_LEN                                 8       /*!< Length of features byte array */
#define HCI_ADV_DATA_LEN                             31      /*!< Length of advertising data */
#define HCI_SCAN_DATA_LEN                            31      /*!< Length of scan response data */
#define HCI_EXT_ADV_DATA_LEN                         251     /*!< Length of extended advertising data */
#define HCI_EXT_ADV_CONN_DATA_LEN                    191     /*!< Length of extended connectable advertising data */
#define HCI_PER_ADV_DATA_LEN                         252     /*!< Length of periodic advertising data */
#define HCI_EXT_ADV_RPT_DATA_LEN                     229     /*!< Length of extended advertising report data */
#define HCI_PER_ADV_RPT_DATA_LEN                     247     /*!< Length of periodic advertising report data */
#define HCI_CHAN_MAP_LEN                             5       /*!< Length of channel map byte array */
#define HCI_KEY_LEN                                  16      /*!< Length of encryption key */
#define HCI_ENCRYPT_DATA_LEN                         16      /*!< Length of data used in encryption */
#define HCI_RAND_LEN                                 8       /*!< Length of random number */
#define HCI_LE_STATES_LEN                            8       /*!< Length of LE states byte array */
#define HCI_P256_KEY_LEN                             64      /*!< Length of P256 key */
#define HCI_DH_KEY_LEN                               32      /*!< Length of DH Key */
#define HCI_BC_LEN                                   16      /*!< Broadcast code length */

#define HCI_EXT_ADV_RPT_DATA_LEN_OFFSET              23      /*!< \brief Length field offset of extended advertising report data */
#define HCI_PER_ADV_RPT_DATA_LEN_OFFSET              6       /*!< \brief Length field offset of periodic advertising report data */
/**@}*/

/** \name Number of Antenna IDs in Switching Pattern
*
*/
/**@{*/
#define HCI_MIN_NUM_ANTENNA_IDS                      2       /*!< \brief Minimum number of Antenna IDs in switching pattern */
#define HCI_MAX_NUM_ANTENNA_IDS                      75      /*!< \brief Maximum number of Antenna IDs in switching pattern */
/**@}*/

/** \name IQ Report Sample Counts
*
*/
/**@{*/
#define HCI_IQ_RPT_SAMPLE_CNT_MIN                    9       /*!< \brief Minimum number of sample pairs in IQ report */
#define HCI_IQ_RPT_SAMPLE_CNT_MAX                    82      /*!< \brief Maximum number of sample pairs in IQ report */

#define HCI_CONN_IQ_RPT_SAMPLE_CNT_OFFSET            12      /*!< \brief Sample count field offset of connection IQ report */
/**@}*/

/** \name CIS Count
*
*/
/**@{*/
#define HCI_MAX_CIS_COUNT                            0x10    /*!< Maximum count for CIS */
/**@}*/

/** \name BIS Count
*
*/
/**@{*/
#define HCI_MAX_BIS_COUNT                            0x10    /*!< Maximum count for BIS */
/**@}*/

/** \name CIG IDs
*
*/
/**@{*/
#define HCI_MIN_CIG_ID                               0x00    /*!< Minimum value for CIG ID. */
#define HCI_MAX_CIG_ID                               0xEF    /*!< Maximum value for CIG ID. */
/**@}*/

/** \name CIS IDs
*
*/
/**@{*/
#define HCI_MIN_CIS_ID                               0x00    /*!< Minimum value for CIS ID. */
#define HCI_MAX_CIS_ID                               0xEF    /*!< Maximum value for CIS ID. */
/**@}*/

/** \name Packing Scheme
*
*/
/**@{*/
#define HCI_PACKING_SEQUENTIAL                       0x00    /*!< Sequential */
#define HCI_PACKING_INTERLEAVED                      0x01    /*!< Interleaved */
/**@}*/

/** \name Framing
*
*/
/**@{*/
#define HCI_FRAMING_UNFRAMED                         0x00    /*!< Unframed */
#define HCI_FRAMING_FRAMED                           0x01    /*!< Framed */
/**@}*/

/** \name Slave Clock Accuracy
*
*/
/**@{*/
#define HCI_MIN_SCA                                  0x00    /*!< Minimum value for SCA. */
#define HCI_MAX_SCA                                  0x07    /*!< Maximum value for SCA. */

/** \name SDU Size
*
*/
/**@{*/
#define HCI_MIN_SDU_SIZE                             0x0000  /*!< Minimum value for SDU size. */
#define HCI_MAX_SDU_SIZE                             0x0FFF  /*!< Maximum value for SDU size. */
/**@}*/

/** \name SDU Interval
*
*/
/**@{*/
#define HCI_MIN_SDU_INTERV                           0x0000FF /*!< Minimum value for SDU interval. */
#define HCI_MAX_SDU_INTERV                           0x0FFFFF /*!< Maximum value for SDU interval. */
#define HCI_DEFAULT_SDU_INTERV                       0x004E20 /*!< Default value for SDU interval. */
/**@}*/

/** \name CIS Transport Latency
*
*/
/**@{*/
#define HCI_MIN_CIS_TRANS_LAT                        0x0005  /*!< Minimum value for CIS transport latency. */
#define HCI_MAX_CIS_TRANS_LAT                        0x0FA0  /*!< Maximum value for CIS transport latency. */
#define HCI_DEFAULT_CIS_TRANS_LAT                    0x0028  /*!< Default value for CIS transport latency. */
/**@}*/

