AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/third_party/cordio/wsf/include/hci_defs.h
/** \name CIS Flush Time
*
*/
/**@{*/
#define HCI_MIN_CIS_FT                               0x01    /*!< Minimum value for CIS flush time. */
#define HCI_MAX_CIS_FT                               0xFF    /*!< Maximum value for CIS flush time. */
/**@}*/

/** \name CIS Burst Number
*
*/
/**@{*/
#define HCI_MIN_CIS_BN                               0x00    /*!< Minimum value for CIS burst number. */
#define HCI_MAX_CIS_BN                               0x0F    /*!< Maximum value for CIS burst number. */
/**@}*/

/** \name CIS Retransmission Number
*
*/
/**@{*/
#define HCI_MIN_CIS_RTN                              0x00    /*!< Minimum value for CIS retransmission number. */
#define HCI_MAX_CIS_RTN                              0x0F    /*!< Maximum value for CIS retransmission number. */
/**@}*/

/** \name ISO Data Path Direction
*
*/
/**@{*/
#define HCI_ISO_DATA_DIR_INPUT                       0       /*!< Input (Host to Controller) data path. */
#define HCI_ISO_DATA_DIR_OUTPUT                      1       /*!< Output (Controller to Host) data path. */
/**@}*/

/** \name ISO Data Path Direction Bit
*
*/
/**@{*/
#define HCI_ISO_DATA_PATH_INPUT_BIT                  (1<<HCI_ISO_DATA_DIR_INPUT)  /*!< Data path input bit. */
#define HCI_ISO_DATA_PATH_OUTPUT_BIT                 (1<<HCI_ISO_DATA_DIR_OUTPUT) /*!< Data path output bit. */
/**@}*/

/** \name ISO Data Path ID
*
*/
/**@{*/
#define HCI_ISO_DATA_PATH_HCI                        0x00    /*!< HCI data path. */
#define HCI_ISO_DATA_PATH_VS_I2S                     0x01    /*!< Vendor Specific: I2S data path. */
#define HCI_ISO_DATA_PATH_DISABLED                   0xFF    /*!< Data path is disabled. */
/**@}*/

/** \name ISO test packet payload type
*
*/
/**@{*/
#define HCI_ISO_ISO_PLD_TYPE_ZERO_LEN                0x00    /*!< Zero length payload. */
#define HCI_ISO_ISO_PLD_TYPE_VAR_LEN                 0x01    /*!< Variable length payload. */
#define HCI_ISO_ISO_PLD_TYPE_MAX_LEN                 0x02    /*!< Maximum length payload. */
/**@}*/

/** \name Maximum number of codecs
*
*/
/**@{*/
#define HCI_MAX_CODEC                                5       /*!< Maximum number of codecs to read from the Controller. */
/**@}*/

/** \name Maximum length of codec-specific capability data
*
*/
/**@{*/
#define HCI_CODEC_CAP_DATA_LEN                       4       /*!< Maximum length of codec-specific capability data. */
/**@}*/

/** \name Codec transport types
*
*/
/**@{*/
#define HCI_CODEC_TRANS_CIS_BIT                      (1<<2)  /*!< Codec supported over LE CIS. */
#define HCI_CODEC_TRANS_BIS_BIT                      (1<<3)  /*!< Codec supported over LE BIS. */
/**@}*/

/** \name ISO Header Packet Boundary
*
*/
/**@{*/
#define HCI_ISO_HDR_PB_START_FRAG                    0x00    /*!< Start fragment of a fragmented SDU. */
#define HCI_ISO_HDR_PB_CONT_FRAG                     0x01    /*!< Continuation fragment of a fragmented SDU. */
#define HCI_ISO_HDR_PB_COMP_FRAG                     0x02    /*!< Complete SDU. */
#define HCI_ISO_HDR_PB_END_FRAG                      0x03    /*!< The end fragment of a fragmented SDU. */
/**@}*/

/** \name ISOAL Segmentation Header Start/Continuation Bit
*
*/
/**@{*/
#define HCI_ISOAL_SEG_HDR_SC_START                   0x00    /*!< ISOAL segmentation header start bit. */
#define HCI_ISOAL_SEG_HDR_SC_CONT                    0x01    /*!< ISOAL segmentation header continue bit. */
/**@}*/

/** \name Company ID
 *
 */
/**@{*/
#define HCI_ID_PACKETCRAFT                           0x07E8  /*!< Packetcraft Inc. company ID */
/**@}*/

/** \name Manufacturer location in Local version
 *
 */
/**@{*/
#define HCI_LOCAL_VER_MANUFACTURER_POS               4       /*!< Manufacturer location in local version */
/**@}*/

/** \name Coding Format Assigned Numbers
 *
 */
/**@{*/
#define HCI_ID_LC3                                   0x01    /*!< LC3 ID */
#define HCI_ID_VS                                    0xFF    /*!< Vendor specific ID */
/**@}*/

/* \} */    /* STACK_HCI_API */

#ifdef __cplusplus
};
#endif

#endif /* HCI_DEFS_H */
